Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.88/PIC32CM-LS60/edc/PIC32CM1216LS60064.PIC
      <edc:SFRDef edc:_addr="0xE0001FB4" edc:access="-----------------------------rrr" edc:cname="DWT_LSR" edc:impl="0x7" edc:nzwidth="0x20" ltx:memberofperipheral="DWT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="SLI" edc:desc="Software Lock implemented" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SLK" edc:desc="Software Lock status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="nTT" edc:desc="Not thirty-two bit" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0xE0001FB8" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0xE0001FBC" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="DWT_DEVARCH" edc:mclr="01000111011100000001101000000010" edc:nzwidth="0x20" edc:por="01000111011100000001101000000010" ltx:memberofperipheral="DWT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="ARCHPART" edc:desc="Architecture Part" edc:nzwidth="0xC"/>
            <edc:SFRFieldDef edc:cname="ARCHVER" edc:desc="Architecture Version" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="REVISION" edc:desc="Revision" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="PRESENT" edc:desc="DEVARCH Present" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARCHITECT" edc:desc="Architect" edc:nzwidth="0xB"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0xE0001FC0" edc:offset="0xC"/>
      <edc:SFRDef edc:_addr="0xE0001FCC" edc:access="------------------------rrrrrrrr" edc:cname="DWT_DEVTYPE" edc:impl="0xFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DWT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="MAJOR" edc:desc="Major type" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="SUB" edc:desc="Sub-type" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE0001FD0" edc:access="------------------------rrrrrrrr" edc:cname="DWT_PIDR4" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="DWT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="DES_2" edc:desc="JEP106 continuation code" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="SIZE" edc:desc="4KB count" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE0001FD4" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="DWT_PIDR5" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DWT"/>
      <edc:SFRDef edc:_addr="0xE0001FD8" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="DWT_PIDR6" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DWT"/>
      <edc:SFRDef edc:_addr="0xE0001FDC" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="DWT_PIDR7" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DWT"/>
      <edc:SFRDef edc:_addr="0xE0001FE0" edc:access="------------------------rrrrrrrr" edc:cname="DWT_PIDR0" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="DWT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="PART_0" edc:desc="Part number bits[7:0]" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE0001FE4" edc:access="------------------------rrrrrrrr" edc:cname="DWT_PIDR1" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="DWT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="PART_1" edc:desc="Part number bits[11:8]" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="DES_0" edc:desc="JEP106 identification code bits [3:0]" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE0001FE8" edc:access="------------------------rrrrrrrr" edc:cname="DWT_PIDR2" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="DWT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="DES_1" edc:desc="JEP106 identification code bits[6:4]" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="JEDEC" edc:desc="JEDEC assignee value is used" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="REVISION" edc:desc="Component revision" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE0001FEC" edc:access="------------------------rrrrrrrr" edc:cname="DWT_PIDR3" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="DWT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="CMOD" edc:desc="Customer Modified" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="REVAND" edc:desc="RevAnd" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE0001FF0" edc:access="------------------------rrrrrrrr" edc:cname="DWT_CIDR0" edc:impl="0xFF" edc:mclr="00000000000000000000000000001101" edc:nzwidth="0x20" edc:por="00000000000000000000000000001101" ltx:memberofperipheral="DWT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="PRMBL_0" edc:desc="CoreSight component identification preamble" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE0001FF4" edc:access="------------------------rrrrrrrr" edc:cname="DWT_CIDR1" edc:impl="0xFF" edc:mclr="00000000000000000000000010010000" edc:nzwidth="0x20" edc:por="00000000000000000000000010010000" ltx:memberofperipheral="DWT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="PRMBL_1" edc:desc="CoreSight component identification preamble" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="CLASS" edc:desc="CoreSight component class" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE0001FF8" edc:access="------------------------rrrrrrrr" edc:cname="DWT_CIDR2" edc:impl="0xFF" edc:mclr="00000000000000000000000000000101" edc:nzwidth="0x20" edc:por="00000000000000000000000000000101" ltx:memberofperipheral="DWT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="PRMBL_2" edc:desc="CoreSight component identification preamble" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE0001FFC" edc:access="------------------------rrrrrrrr" edc:cname="DWT_CIDR3" edc:impl="0xFF" edc:mclr="00000000000000000000000010110001" edc:nzwidth="0x20" edc:por="00000000000000000000000010110001" ltx:memberofperipheral="DWT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="PRMBL_3" edc:desc="CoreSight component identification preamble" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE0002000" edc:access="nnnn-------------nnnnnnnnnnn--nn" edc:cname="FP_CTRL" edc:impl="0xF0007FF3" edc:nzwidth="0x20" ltx:memberofperipheral="FPB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FPB">
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Flash Patch global enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="KEY" edc:desc="FP_CTRL write-enable key" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="NUM_CODE" edc:desc="Number of implemented code comparators bits [3:0]" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="NUM_LIT" edc:desc="Number of literal comparators" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="NUM_CODE_1" edc:desc="Number of implemented code comparators bits [6:4]" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0xD"/>
            <edc:SFRFieldDef edc:cname="REV" edc:desc="Revision" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE0002004" edc:access="--rrrrrrrrrrrrrrrrrrrrrrrrr-----" edc:cname="FP_REMAP" edc:impl="0x3FFFFFE0" edc:nzwidth="0x20" ltx:memberofperipheral="FPB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FPB">
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="REMAP" edc:desc="Remap address" edc:nzwidth="0x18"/>
            <edc:SFRFieldDef edc:cname="RMPSPT" edc:desc="Remap supported" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE0002008" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="FP_COMP0" edc:nzwidth="0x20" ltx:memberofperipheral="FPB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FPB">
            <edc:SFRFieldDef edc:cname="BE" edc:desc="Breakpoint enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BPADDR" edc:desc="Breakpoint address" edc:nzwidth="0x1F"/>
            <edc:AdjustPoint edc:offset="-30"/>
            <edc:SFRFieldDef edc:cname="FPADDR" edc:desc="Flash Patch address" edc:nzwidth="0x1B"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FE" edc:desc="Flash Patch enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000200C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="FP_COMP1" edc:nzwidth="0x20" ltx:memberofperipheral="FPB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FPB">
            <edc:SFRFieldDef edc:cname="BE" edc:desc="Breakpoint enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BPADDR" edc:desc="Breakpoint address" edc:nzwidth="0x1F"/>
            <edc:AdjustPoint edc:offset="-30"/>
            <edc:SFRFieldDef edc:cname="FPADDR" edc:desc="Flash Patch address" edc:nzwidth="0x1B"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FE" edc:desc="Flash Patch enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE0002010" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="FP_COMP2" edc:nzwidth="0x20" ltx:memberofperipheral="FPB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FPB">
            <edc:SFRFieldDef edc:cname="BE" edc:desc="Breakpoint enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BPADDR" edc:desc="Breakpoint address" edc:nzwidth="0x1F"/>
            <edc:AdjustPoint edc:offset="-30"/>
            <edc:SFRFieldDef edc:cname="FPADDR" edc:desc="Flash Patch address" edc:nzwidth="0x1B"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FE" edc:desc="Flash Patch enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE0002014" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="FP_COMP3" edc:nzwidth="0x20" ltx:memberofperipheral="FPB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FPB">
            <edc:SFRFieldDef edc:cname="BE" edc:desc="Breakpoint enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BPADDR" edc:desc="Breakpoint address" edc:nzwidth="0x1F"/>
            <edc:AdjustPoint edc:offset="-30"/>
            <edc:SFRFieldDef edc:cname="FPADDR" edc:desc="Flash Patch address" edc:nzwidth="0x1B"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FE" edc:desc="Flash Patch enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0xE0002018" edc:offset="0xF98"/>
      <edc:SFRDef edc:_addr="0xE0002FB0" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="FP_LAR" edc:nzwidth="0x20" ltx:memberofperipheral="FPB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FPB">
            <edc:SFRFieldDef edc:cname="KEY" edc:desc="Lock access control" edc:nzwidth="0x20">
              <edc:SFRFieldSemantic edc:cname="UNLOCK" edc:desc="Unlock key value" edc:when="(field &amp; 0xFFFFFFFF) == 0xC5ACCE55"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE0002FB4" edc:access="-----------------------------rrr" edc:cname="FP_LSR" edc:impl="0x7" edc:nzwidth="0x20" ltx:memberofperipheral="FPB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FPB">
            <edc:SFRFieldDef edc:cname="SLI" edc:desc="Software Lock implemented" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SLK" edc:desc="Software Lock status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="nTT" edc:desc="Not thirty-two bit" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0xE0002FB8" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0xE0002FBC" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="FP_DEVARCH" edc:mclr="01000111011100000001101000000011" edc:nzwidth="0x20" edc:por="01000111011100000001101000000011" ltx:memberofperipheral="FPB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FPB">
            <edc:SFRFieldDef edc:cname="ARCHPART" edc:desc="Architecture Part" edc:nzwidth="0xC"/>
            <edc:SFRFieldDef edc:cname="ARCHVER" edc:desc="Architecture Version" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="REVISION" edc:desc="Revision" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="PRESENT" edc:desc="DEVARCH Present" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARCHITECT" edc:desc="Architect" edc:nzwidth="0xB"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
