Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.88/PIC32CM-LS60/edc/PIC32CM1216LS60064.PIC
      <edc:SFRDef edc:_addr="0xE000ED7C" edc:access="rrr-rrrrrrrrrrrr------------rrrr" edc:cname="CTR" edc:impl="0xEFFF000F" edc:nzwidth="0x20" ltx:memberofperipheral="SCB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SCB">
            <edc:SFRFieldDef edc:cname="IminLine" edc:desc="Instruction cache minimum line length" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="DminLine" edc:desc="Data cache minimum line length" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="ERG" edc:desc="Exclusives Reservation Granule" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="CWG" edc:desc="Cache Write-back Granule" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="Format" edc:desc="Cache Type Register format" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No cache type information provided" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Cache type information is provided" edc:when="(field &amp; 0x7) == 4"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000ED80" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="CCSIDR" edc:nzwidth="0x20" ltx:memberofperipheral="SCB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SCB">
            <edc:SFRFieldDef edc:cname="LineSize" edc:desc="log2(number of words per line) - 2" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="Associativity" edc:desc="Associativity - 1" edc:nzwidth="0xA"/>
            <edc:SFRFieldDef edc:cname="NumSets" edc:desc="Number of sets - 1" edc:nzwidth="0xF"/>
            <edc:SFRFieldDef edc:cname="WA" edc:desc="Write-Allocate" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RA" edc:desc="Read-Allocate" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WB" edc:desc="Write-Back" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WT" edc:desc="Write-Through" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000ED84" edc:access="----------------------------nnnn" edc:cname="CSSELR" edc:impl="0xF" edc:nzwidth="0x20" ltx:memberofperipheral="SCB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SCB">
            <edc:SFRFieldDef edc:cname="InD" edc:desc="Instruction not Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="Level" edc:desc="Cache level - 1" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0xE000ED88" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0xE000ED90" edc:access="----------------rrrrrrrr-------r" edc:cname="MPU_TYPE" edc:impl="0xFF01" edc:nzwidth="0x20" ltx:memberofperipheral="MPU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MPU">
            <edc:SFRFieldDef edc:cname="SEPARATE" edc:desc="Separate instructions and data address regions" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="DREGION" edc:desc="Number of MPU data regions" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000ED94" edc:access="-----------------------------nnn" edc:cname="MPU_CTRL" edc:impl="0x7" edc:nzwidth="0x20" ltx:memberofperipheral="MPU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MPU">
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="MPU enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HFNMIENA" edc:desc="HardFault, NMI enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PRIVDEFENA" edc:desc="Privileged default enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000ED98" edc:access="------------------------nnnnnnnn" edc:cname="MPU_RNR" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="MPU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MPU">
            <edc:SFRFieldDef edc:cname="REGION" edc:desc="Selected region number" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000ED9C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="MPU_RBAR" edc:nzwidth="0x20" ltx:memberofperipheral="MPU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MPU">
            <edc:SFRFieldDef edc:cname="XN" edc:desc="Execute Never" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AP" edc:desc="Access permissions" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="RWPRIV" edc:desc="Read/write by privileged code only" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="RWANY" edc:desc="Read/write by any privilege level" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="RPRIV" edc:desc="Read-only by privileged code only" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="RANY" edc:desc="Read-only by any privilege level" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SH" edc:desc="Shareability" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="Non-shareable" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="OUTER" edc:desc="Outer shareable" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="INNER" edc:desc="Inner shareable" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BASE" edc:desc="Base address" edc:nzwidth="0x1B"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000EDA0" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnn-nnnn" edc:cname="MPU_RLAR" edc:impl="0xFFFFFFEF" edc:nzwidth="0x20" ltx:memberofperipheral="MPU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MPU">
            <edc:SFRFieldDef edc:cname="EN" edc:desc="Region enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AttrInd" edc:desc="Attribute Index" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="LIMIT" edc:desc="Limit address" edc:nzwidth="0x1B"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
