Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.88/PIC32CM-LS60/edc/PIC32CM1216LS60064.PIC
      <edc:SFRDef edc:_addr="0xE002E388" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVIC_NS_ITNS2" edc:nzwidth="0x20" ltx:memberofperipheral="NVIC_NS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC_NS">
            <edc:SFRFieldDef edc:cname="ITNS" edc:desc="Interrupt Targets Non-secure" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0xE002E38C" edc:offset="0x74"/>
      <edc:SFRDef edc:_addr="0xE002E400" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVIC_NS_IPR0" edc:nzwidth="0x20" ltx:memberofperipheral="NVIC_NS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC_NS">
            <edc:SFRFieldDef edc:cname="PRI_N0" edc:desc="Priority of interrupt number 4n+0" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N1" edc:desc="Priority of interrupt number 4n+1" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N2" edc:desc="Priority of interrupt number 4n+2" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N3" edc:desc="Priority of interrupt number 4n+3" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE002E404" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVIC_NS_IPR1" edc:nzwidth="0x20" ltx:memberofperipheral="NVIC_NS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC_NS">
            <edc:SFRFieldDef edc:cname="PRI_N0" edc:desc="Priority of interrupt number 4n+0" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N1" edc:desc="Priority of interrupt number 4n+1" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N2" edc:desc="Priority of interrupt number 4n+2" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N3" edc:desc="Priority of interrupt number 4n+3" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE002E408" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVIC_NS_IPR2" edc:nzwidth="0x20" ltx:memberofperipheral="NVIC_NS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC_NS">
            <edc:SFRFieldDef edc:cname="PRI_N0" edc:desc="Priority of interrupt number 4n+0" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N1" edc:desc="Priority of interrupt number 4n+1" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N2" edc:desc="Priority of interrupt number 4n+2" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N3" edc:desc="Priority of interrupt number 4n+3" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE002E40C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVIC_NS_IPR3" edc:nzwidth="0x20" ltx:memberofperipheral="NVIC_NS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC_NS">
            <edc:SFRFieldDef edc:cname="PRI_N0" edc:desc="Priority of interrupt number 4n+0" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N1" edc:desc="Priority of interrupt number 4n+1" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N2" edc:desc="Priority of interrupt number 4n+2" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N3" edc:desc="Priority of interrupt number 4n+3" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE002E410" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVIC_NS_IPR4" edc:nzwidth="0x20" ltx:memberofperipheral="NVIC_NS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC_NS">
            <edc:SFRFieldDef edc:cname="PRI_N0" edc:desc="Priority of interrupt number 4n+0" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N1" edc:desc="Priority of interrupt number 4n+1" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N2" edc:desc="Priority of interrupt number 4n+2" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N3" edc:desc="Priority of interrupt number 4n+3" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE002E414" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVIC_NS_IPR5" edc:nzwidth="0x20" ltx:memberofperipheral="NVIC_NS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC_NS">
            <edc:SFRFieldDef edc:cname="PRI_N0" edc:desc="Priority of interrupt number 4n+0" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N1" edc:desc="Priority of interrupt number 4n+1" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N2" edc:desc="Priority of interrupt number 4n+2" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N3" edc:desc="Priority of interrupt number 4n+3" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE002E418" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVIC_NS_IPR6" edc:nzwidth="0x20" ltx:memberofperipheral="NVIC_NS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC_NS">
            <edc:SFRFieldDef edc:cname="PRI_N0" edc:desc="Priority of interrupt number 4n+0" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N1" edc:desc="Priority of interrupt number 4n+1" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N2" edc:desc="Priority of interrupt number 4n+2" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N3" edc:desc="Priority of interrupt number 4n+3" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
